
import math

# Выведите на консоль значение прощади этого круга 𝑆=𝜋𝑟**2

r = 56
s = math.pi*r**2
print(round(s, 2))

# координаты точки
point = (35, 29)

# вычисляем расстояние от точки до начала координат (0, 0)
distance = math.sqrt(point[0]**2 + point[1]**2)
# Проверяем, находится ли точка внутри круга
is_inside_point = distance <= r
print(is_inside_point)  # Выводим результат для первой точки

# Аналогично для другой точки
point_2 = (39, 65)
distance_2 = math.sqrt(point_2[0]**2 + point_2[1]**2)
is_inside_point_2 = distance_2 <= r
print(is_inside_point_2)  # Выводим результат для второй точки



